## Plan output

```
module.logging.module.s3.data.aws_caller_identity.current: Reading...
module.application.module.database.module.database.data.aws_partition.current: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Reading...
module.application.module.dashboard.data.aws_caller_identity.identity: Reading...
module.application.module.database.data.aws_rds_engine_version.this: Reading...
module.application.module.database.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Reading...
module.application.module.dashboard.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Reading...
module.logging.module.s3.data.aws_caller_identity.current: Read complete after 0s [id=891377151751]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Read complete after 0s [id=874300523]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Reading...
module.application.module.worker.data.aws_region.current: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.application.module.worker.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.secrets.data.aws_region.current: Reading...
module.application.module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.module.s3.data.aws_region.current: Reading...
module.application.module.dashboard.data.aws_region.current: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Reading...
module.logging.module.s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.dashboard.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.data.aws_region.current: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.logging.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.data.aws_partition.current: Reading...
module.logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.service.data.aws_region.current: Reading...
module.application.module.service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.dashboard.data.aws_route53_zone.domain["this"]: Reading...
module.application.module.service.data.aws_caller_identity.identity: Reading...
module.application.module.service.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Read complete after 0s [id=2644592029]
module.logging.data.aws_lambda_functions.all: Reading...
module.bastion.data.aws_partition.current: Reading...
module.bastion.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Read complete after 0s [id=1315226949]
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=891377151751]
module.application.module.worker.data.aws_partition.current: Reading...
module.application.module.worker.data.aws_partition.current: Read complete after 0s [id=aws]
module.backend.data.aws_partition.current: Reading...
module.backend.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.database.data.aws_caller_identity.identity: Reading...
module.application.module.database.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.module.service.module.ecr["this"].data.aws_partition.current: Reading...
module.application.module.service.module.ecr["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.data.aws_elb_service_account.current: Reading...
module.logging.data.aws_elb_service_account.current: Read complete after 0s [id=127311923021]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Read complete after 0s [id=1808222790]
module.application.module.worker.data.aws_caller_identity.identity: Reading...
module.bastion.data.aws_caller_identity.identity: Reading...
module.application.module.worker.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.logging.module.s3.data.aws_partition.current: Reading...
module.bastion.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.module.service.data.aws_route53_zone.domain["this"]: Reading...
module.logging.module.s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.dashboard.module.alb["this"].data.aws_partition.current: Reading...
module.application.module.dashboard.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.application.data.aws_lambda_functions.all: Reading...
module.application.module.dashboard.data.aws_route53_zone.domain["this"]: Read complete after 0s [id=Z056235726NAHLFZ5UGDD]
module.bastion.data.aws_region.current: Reading...
module.bastion.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.secrets.data.aws_caller_identity.identity: Reading...
module.application.module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.logging.data.aws_caller_identity.identity: Reading...
module.logging.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.backend.data.aws_caller_identity.identity: Reading...
module.logging.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.application.module.secrets.data.aws_partition.current: Reading...
module.application.module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.backend.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.vpc.data.aws_availability_zones.available: Reading...
module.bastion.data.aws_ami.bastion: Reading...
module.application.module.database.data.aws_rds_engine_version.this: Read complete after 0s [id=17.5]
module.application.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Reading...
module.application.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Read complete after 0s [id=76086537]
module.application.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_partition.current[0]: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.application.module.service.module.ecr["this"].data.aws_caller_identity.current: Reading...
module.application.module.service.module.ecr["this"].data.aws_caller_identity.current: Read complete after 0s [id=891377151751]
module.logging.module.s3.data.aws_organizations_organization.current: Reading...
module.application.module.database.data.aws_partition.current: Reading...
module.application.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.dashboard.data.aws_partition.current: Reading...
module.application.module.dashboard.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.application.module.database.data.aws_region.current: Reading...
module.application.module.database.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.service.module.alb["this"].data.aws_partition.current: Reading...
module.application.module.service.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.service.data.aws_partition.current: Reading...
module.application.module.service.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.service.data.aws_route53_zone.domain["this"]: Read complete after 0s [id=Z056235726NAHLFZ5UGDD]
module.application.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Reading...
module.application.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=475677258]
module.bastion.data.aws_ami.bastion: Read complete after 0s [id=ami-0150ccaf51ab55a51]
module.logging.data.aws_lambda_function.datadog["this"]: Reading...
module.logging.module.s3.data.aws_organizations_organization.current: Read complete after 0s [id=o-f5mr0gq6lc]
module.application.data.aws_lambda_function.datadog["this"]: Reading...
module.logging.module.s3.data.aws_iam_policy_document.default: Reading...
module.logging.module.s3.data.aws_iam_policy_document.default: Read complete after 0s [id=705826187]
module.application.module.dashboard.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Reading...
module.application.module.worker.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Reading...
module.application.module.dashboard.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Read complete after 1s [id=/illinois-getchildcare/qa/version]
module.application.module.service.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Reading...
module.application.module.worker.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Read complete after 0s [id=/illinois-getchildcare/qa/version]
module.application.module.service.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Read complete after 0s [id=/illinois-getchildcare/qa/version]
module.application.data.aws_lambda_function.datadog["this"]: Read complete after 1s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.logging.data.aws_lambda_function.datadog["this"]: Read complete after 1s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.logging.module.s3.data.aws_iam_policy_document.combined: Reading...
module.logging.module.s3.data.aws_iam_policy_document.combined: Read complete after 0s [id=2124188810]
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2"]: Reading...
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=90403638]
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm"]: Read complete after 0s [id=us-east-1]
module.application.module.dashboard.data.aws_vpc.current: Reading...
module.application.module.worker.data.aws_vpc.current: Reading...
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Read complete after 0s [id=us-east-1]
module.application.module.service.data.aws_vpc.current: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Read complete after 0s [id=us-east-1]
module.application.module.worker.data.aws_vpc.current: Read complete after 1s [id=vpc-0d4fbd78717d772f7]
module.application.module.dashboard.data.aws_vpc.current: Read complete after 1s [id=vpc-0d4fbd78717d772f7]
module.application.module.service.data.aws_vpc.current: Read complete after 1s [id=vpc-0d4fbd78717d772f7]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 0s [id=1315226949]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 0s [id=2644592029]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 0s [id=874300523]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=195798706]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Read complete after 0s [id=1808222790]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # module.application.module.dashboard.module.alb["this"].aws_lb_target_group.this["endpoint"] will be updated in-place
  ~ resource "aws_lb_target_group" "this" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:891377151751:targetgroup/il-gcc-qa-dshbd-app/c9dfc0b53aa92bf7"
        name                               = "il-gcc-qa-dshbd-app"
        tags                               = {
            "service"               = "application-dashboard"
            "terraform-aws-modules" = "alb"
        }
        # (17 unchanged attributes hidden)

      ~ health_check {
          ~ path                = "/actuator/health" -> "/dashboard/overview"
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.application.module.secrets.module.secrets_manager["oidc"].aws_secretsmanager_secret.this[0] will be created
  + resource "aws_secretsmanager_secret" "this" {
      + arn                            = (known after apply)
      + description                    = "IL-GCC jobrunr oidc credentials"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = "alias/illinois-getchildcare/qa/il-gcc-application/secrets"
      + name                           = (known after apply)
      + name_prefix                    = "illinois-getchildcare/qa/il-gcc-application/oidc-"
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "service" = "il-gcc-application"
        }
      + tags_all                       = {
          + "environment" = "qa"
          + "project"     = "illinois-getchildcare"
          + "service"     = "il-gcc-application"
          + "tofu"        = "true"
        }

      + replica (known after apply)
    }

  # module.application.module.secrets.module.secrets_manager["oidc"].aws_secretsmanager_secret_version.ignore_changes[0] will be created
  + resource "aws_secretsmanager_secret_version" "ignore_changes" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```